/***********************************************************************************************************
* brief: Charge Interface
* create date: 2018-10-11
* create author: YuL
************************************************************************************************************
* modify date: xxxx-xx-xx
* modify author: xxxxxx
* modify note: xx
************************************************************************************************************
* modify date: xxxx-xx-xx
* modify author: xxxxxx
* modify note: xx
************************************************************************************************************/
#include "includes.h"
#include "ChgInterface.h" 
#include "EXT_ChgTask.h"

/************************************************************************************************************
** 函 数 名 : StartCharge
** 功能描述 : 启动充电函数接口函数
** 输    入 : APVol 辅助电源类型12/24
** 输    出 : 无
** 返    回 : 1 ==启动充电成功   0 == 启动充电失败
*************************************************************************************************************
*/
uint8_t StartCharge(uint8_t port, uint8_t APVol)
{
	return EXT_StartCharge(port, APVol);
}

/************************************************************************************************************
** 函 数 名 : StopCharge
** 功能描述 : 停止充电接口函数
** 输    入 : 无
** 输    出 : 无
** 返    回 : 1 == 停止充电成功   0 == 停止充电失败
*************************************************************************************************************
*/
uint8_t StopCharge(uint8_t port)
{
	return EXT_StopCharge(port);
}

/************************************************************************************************************
** 函 数 名 : GetChgInfo
** 功能描述 : 获取充电信息接口函数
** 输    入 : port 0 --- A枪  1 --- B枪
** 输    出 : 无
** 返    回 : CHARGEINFO 充电信息结构体
*************************************************************************************************************
*/

CHARGEINFO GetChgInfo(uint8_t port)
{	
	return GetEXT_CCBInfo(port);
}



/************************************************************************************************************
** 函 数 名 : GetStopCause
** 功能描述 : 获取充电停止原因接口函数
** 输    入 : 无
** 输    出 : 无
** 返    回 : 1 ==启动充电成功   0 == 启动充电失败
*************************************************************************************************************
*/
uint8_t GetStopCause(uint8_t port)
{
	return GetEXT_StopCause(port);
}




/************************************************************************************************************
** 函 数 名 : ChargeTask
** 功能描述 : 充电处理任务
** 输    入 : 无
** 输    出 : 无
** 返    回 : 无
*************************************************************************************************************
*/
void ChargeTask(void * pdata)
{
	uint8_t port, PortNum; 
	PortNum = ParaGetChgGunNumber();	
	
	while(1) {
		for (port = 0; port < PortNum; port++){		
			ChgHandle(port);
			OSTimeDlyHMSM (0, 0, 0, 10);
		}
	}
}

